In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('g:/dataset/analysis/restaurant.csv')

In [3]:
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [4]:
df.total_bill.sum()

4827.77

In [5]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [16]:
df.groupby(by='day')[['total_bill']].sum()

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [17]:
df.pivot_table(index='day',values='total_bill',aggfunc='sum')

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [19]:
df.pivot_table(index=['day','time'],values='total_bill',aggfunc='sum')

             total_bill
day  time
Fri  Dinner      235.96
     Lunch        89.92
Sat  Dinner     1778.40
Sun  Dinner     1627.16
Thur Dinner       18.78
     Lunch      1077.55

In [20]:
df.groupby(by=['day','time'])[['total_bill']].sum()

             total_bill
day  time
Fri  Dinner      235.96
     Lunch        89.92
Sat  Dinner     1778.40
Sun  Dinner     1627.16
Thur Dinner       18.78
     Lunch      1077.55

In [22]:
df.pivot_table(index=['day'],columns='time',values='total_bill',aggfunc='sum')

time   Dinner    Lunch
day
Fri    235.96    89.92
Sat   1778.40      NaN
Sun   1627.16      NaN
Thur    18.78  1077.55

In [24]:
df.pivot_table(index=['day'],columns='time',values='total_bill',aggfunc=['sum','mean','count'])

          sum                mean             count
time   Dinner    Lunch     Dinner      Lunch Dinner Lunch
day
Fri    235.96    89.92  19.663333  12.845714   12.0   7.0
Sat   1778.40      NaN  20.441379        NaN   87.0   NaN
Sun   1627.16      NaN  21.410000        NaN   76.0   NaN
Thur    18.78  1077.55  18.780000  17.664754    1.0  61.0

In [25]:
resdf=df.pivot_table(index=['day'],columns='time',values='total_bill',aggfunc=['sum','mean','count'])

In [26]:
resdf.to_excel('report.xlsx')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   gender      244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [28]:
df[(df.time=='Lunch')&(df.day=='Sun')]

Empty DataFrame
Columns: [total_bill, tip, gender, smoker, day, time, size]
Index: []

In [31]:
df[(df.time=='Dinner')&(df.gender=='Female')].shape

(52, 7)

In [33]:
df[(df.time=='Dinner')&(df.gender=='Male')].shape

(124, 7)

In [35]:
df[(df.time=='Dinner')].shape

(176, 7)

In [36]:
df=pd.read_csv('g:/dataset/analysis/titanic.csv')

In [37]:
df

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [38]:
 df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [39]:
549/891

0.6161616161616161

In [40]:
342/891

0.3838383838383838

In [41]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [43]:
df.pivot_table(index='Survived',columns='Pclass',values='Pclass',aggfunc='count')

ValueError: Grouper for 'Pclass' not 1-dimensional

In [44]:
df[(df.Survived==1)&(df.Pclass==1)].shape

(136, 12)

In [45]:
df[(df.Survived==0)&(df.Pclass==1)].shape

(80, 12)

In [46]:
df[(df.Survived==1)&(df.Pclass==2)].shape

(87, 12)

In [48]:
df[(df.Survived==0)&(df.Pclass==2)].shape

(97, 12)

In [49]:
df[(df.Survived==1)&(df.Pclass==3)].shape

(119, 12)

In [50]:
df[(df.Survived==0)&(df.Pclass==3)].shape

(372, 12)

In [51]:
df.gender.value_counts()

male      577
female    314
Name: gender, dtype: int64

In [52]:
df[(df.Survived==1)&(df.gender=='male')].shape

(109, 12)

In [53]:
df[(df.Survived==1)&(df.gender=='female')].shape

(233, 12)

In [54]:
df[(df.Age>=0)&(df.Age<=10)].shape

(64, 12)

In [55]:
df[(df.Age>=0)&(df.Age<=10)&(df.Survived==1)].shape

(38, 12)

In [57]:
df[(df.Age>=60)].shape

(26, 12)

In [58]:
df[(df.Age>=60)&(df.Survived==1)].shape

(7, 12)

In [59]:
df[(df.Age>=60)&(df.Survived==1)&(df.gender=='female')].shape

(4, 12)

In [60]:
df[(df.Age>=60)&(df.Survived==1)&(df.Pclass==1)].shape

(5, 12)

In [61]:
df[(df.SibSp==0)&(df.Parch==0)].shape

(537, 12)

In [62]:
df[(df.SibSp==0)&(df.Parch==0)&(df.Survived==1)].shape

(163, 12)

In [63]:
df[(df.Pclass==1)&(df.Survived==1)&(df.gender=='male')].shape

(45, 12)

In [64]:
df[(df.Pclass==1)&(df.gender=='male')].shape

(122, 12)

In [65]:
df[(df.Pclass==1)&(df.Survived==1)&(df.gender=='female')].shape

(91, 12)

In [66]:
df[(df.Pclass==1)&(df.gender=='female')].shape

(94, 12)

In [69]:
df.Age.isnull().sum()

177

In [70]:
df.Survived.isnull().sum()

0

In [71]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [73]:
df[df.Age.isnull()]

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [74]:
df[~(df.Age.isnull())]

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [80]:
a=df[df.Age.notnull()]

In [81]:
a.Survived.value_counts()

0    424
1    290
Name: Survived, dtype: int64

In [82]:
a.Pclass.value_counts()

3    355
1    186
2    173
Name: Pclass, dtype: int64

In [83]:
a[(a.Survived==1)&(a.Pclass==1)].shape

(122, 12)

In [84]:
a[(a.Survived==0)&(a.Pclass==1)].shape

(64, 12)

In [85]:
a[(a.Survived==1)&(a.Pclass==2)].shape

(83, 12)

In [86]:
a[(a.Survived==0)&(a.Pclass==2)].shape

(90, 12)

In [87]:
a[(a.Survived==1)&(a.Pclass==3)].shape

(85, 12)

In [88]:
a[(a.Survived==0)&(a.Pclass==3)].shape

(270, 12)

In [89]:
a.gender.value_counts()

male      453
female    261
Name: gender, dtype: int64

In [90]:
a[(a.Survived==1)&(a.gender=='male')].shape

(93, 12)

In [91]:
a[(a.Survived==1)&(a.gender=='female')].shape

(197, 12)

In [92]:
a[(a.Age>=0)&(a.Age<=10)].shape

(64, 12)

In [95]:
a[(a.SibSp==0)&(a.Parch==0)].shape

(404, 12)

In [96]:
a[(a.SibSp==0)&(a.Parch==0)&(a.Survived==1)].shape

(130, 12)

In [97]:
a[(a.Pclass==1)&(a.Survived==1)&(a.gender=='male')].shape

(40, 12)

In [98]:
a[(a.Pclass==1)&(a.gender=='male')].shape

(101, 12)

In [99]:
a[(a.Pclass==2)&(a.Survived==1)&(a.gender=='male')].shape

(15, 12)

In [101]:
a[(a.Pclass==2)&(a.gender=='male')].shape

(99, 12)

In [102]:
a[(a.Pclass==3)&(a.gender=='male')].shape

(253, 12)

In [103]:
a[(a.Pclass==3)&(a.Survived==1)&(a.gender=='male')].shape

(38, 12)

In [104]:
a[(a.Pclass==1)&(a.Survived==1)&(a.gender=='female')].shape

(82, 12)

In [105]:
a[(a.Pclass==2)&(a.Survived==1)&(a.gender=='female')].shape

(68, 12)

In [106]:
a[(a.Pclass==3)&(a.Survived==1)&(a.gender=='female')].shape

(47, 12)

In [107]:
a[(a.Pclass==3)&(a.gender=='female')].shape

(102, 12)

In [108]:
a[(a.Pclass==2)&(a.gender=='female')].shape

(74, 12)

In [109]:
a[(a.Pclass==1)&(a.gender=='female')].shape

(85, 12)

In [113]:
a[(a.Survived==1)&(a.gender=='male')].count()

PassengerId    93
Survived       93
Pclass         93
Name           93
gender         93
Age            93
SibSp          93
Parch          93
Ticket         93
Fare           93
Cabin          41
Embarked       93
dtype: int64

In [114]:
a[(a.Survived==1)&(a.gender=='female')].count()

PassengerId    197
Survived       197
Pclass         197
Name           197
gender         197
Age            197
SibSp          197
Parch          197
Ticket         197
Fare           197
Cabin           84
Embarked       195
dtype: int64